package com.ratta.enums;

/**
 * @author yll
 * E0501-E0700
 */
public enum ErrorCodeEnum {

    E0018("E0018", "账号或密码错误"),
    E0019("E0019", "账号或密码错误"),
    E0045("E0045", "用户已经被锁定，请稍后再试！"),
    E0070("E0070", "无需更新!"),
    E0077("E0077", "登录的账号跟设备绑定的账号不是同一个!"),
    E0078("E0078", "已有设备正在同步中,请等待结束后再同步!"),
    S0016("S0016", "token不合法"),
    E0550("E0550", "仅允许删除普通日志或已审阅的错误日志！"),
    E0551("E0551", "未下载的记录不允许添加备注！"),
    E0552("E0552", "备注超过最大字符数！"),
    E0553("E0553", "添加备注失败！"),
    E0554("E0554", "仅允许审阅已查看的记录!"),
    E0555("E0555", "操作失败!"),
    E0556("E0556", "设备信息不存在!"),
    E0557("E0557", "下载失败!"),
    E0558("E0558", "添加设备日志失败!"),
    E0502("E0502", "账号不存在!"),
    E0503("E0503", "设备已经绑定其他账号，无法再次绑定新账号!"),
    E0504("E0504", "设备不存在此任务!"),
    E0505("E0505", "设备版本号不能为空!"),
    E0506("E0506", "库存中未发现此设备!"),
    E0501("E0501", "设备不合法"),
    E1202("E1202", "发送短信失败!"),
    E1203("E1203", "网络异常，请重试"),
    ;
    private String key;
    private String value;

    private ErrorCodeEnum(String key, String value) {
        this.key = key;
        this.value = value;
    }

    public String getKey() {
        return this.key;
    }

    public String getValue() {
        return this.value;
    }

}
